ConfigFiles/Enums/СтатусыОшибок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыОшибок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеЗарегистрирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Признана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетИсправленияПовторяемойОшибки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исправлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверенаИсправлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПризнана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отозвана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПланируетсяИсправлять</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Enums/СтатусыОшибок/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует массив статусов ошибок, которые не требуют внимания
//
// Возвращаемое значение:
//   Массив   - статусы не требуеющие внимания
//
Функция СтатусыНеТребуюющиеВнимания() Экспорт
	
	МассивСтатусов = Новый Массив;
	
	МассивСтатусов.Добавить(Перечисления.СтатусыОшибок.Закрыта);
	МассивСтатусов.Добавить(Перечисления.СтатусыОшибок.Отозвана);
	МассивСтатусов.Добавить(Перечисления.СтатусыОшибок.НеПланируетсяИсправлять);
	
	Возврат МассивСтатусов;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Владелец") Тогда
		
		Если ЗначениеЗаполнено(Параметры.Владелец) Тогда
			
			ИспользоватьЗакрытиеОшибок = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Владелец, "ИспользоватьЗакрытиеОшибок");
			Если НЕ ИспользоватьЗакрытиеОшибок Тогда
				СтандартнаяОбработка = Ложь;
				СформироватьДанныеВыбораБезЗакрытия(ДанныеВыбора);
			КонецЕсли;
			
		Иначе
			СтандартнаяОбработка = Ложь;
			СформироватьДанныеВыбораБезЗакрытия(ДанныеВыбора);
		КонецЕсли;
	
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДанныеВыбораБезЗакрытия(ДанныеВыбора)
	
	ДанныеВыбора = Новый СписокЗначений;
			
	ДанныеВыбора.Добавить(Перечисления.СтатусыОшибок.НеЗарегистрирована);
	ДанныеВыбора.Добавить(Перечисления.СтатусыОшибок.Зарегистрирована);
	ДанныеВыбора.Добавить(Перечисления.СтатусыОшибок.Признана);
	ДанныеВыбора.Добавить(Перечисления.СтатусыОшибок.ОжидаетИсправленияПовторяемойОшибки);
	ДанныеВыбора.Добавить(Перечисления.СтатусыОшибок.Исправлена);
	ДанныеВыбора.Добавить(Перечисления.СтатусыОшибок.ПроверенаИсправлена);
	ДанныеВыбора.Добавить(Перечисления.СтатусыОшибок.НеПризнана);
	ДанныеВыбора.Добавить(Перечисления.СтатусыОшибок.Отозвана);
	ДанныеВыбора.Добавить(Перечисления.СтатусыОшибок.НеПланируетсяИсправлять);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
